# список назначений ЛФК, где:
# key - назначение, value - присутствие занятий в субботу
lfk = {
    'procedure': {
        'занятия в малой группе': True,
        'индивидуальные занятия': False,
        'дыхательная гимнастика': True,
        'механотерапия': True,
        'эрготерапия групповая': False,
        'эрготерапия индивидуально': False,
        'классический массаж': False,
    },
    'regimen': ['ежедневно', '№5', '№7', '№10'],
    'ed': ['1,0', '1,5', '2,0', '2,5', '3,0', '4,5', '6,0']
}


physio = [
    ''
]
