def update_after_add_relative(d):
    '''
    '''
    d['родс_полностью'] = f"{d['родс_фио']}, " \
                          f"{d['родс_родство']}"
    d['родс_полностью_тел'] = f"{d['родс_фио']}, " \
                              f"{d['родс_родство']}, " \
                              f"тел. {d['родс_телефон']}"
    for i in range(2, 5):
        if d[f'родс_фио_{i}'] != '':
            d['родс_полностью'] += f"\n{d[f'родс_фио_{i}']}, " \
                                   f"{d[f'родс_родство_{i}']}"
            d['родс_полностью_тел'] += f"\n{d[f'родс_фио_{i}']}, " \
                                       f"{d[f'родс_родство_{i}']}, " \
                                       f"тел. {d[f'родс_телефон_{i}']}"
