rehab_limits = [
    "Низкая толерантность к физической нагрузке",
    "Ожирение II-III ст.",
    "Сформированные двигательные стереотипы",
    "Давность процесса",
    "Выраженный сенсорный дефицит (зрения / слуха)",
    "Выраженные когнитивные нарушения",
    "Выраженные речевые нарушения",
    "Грубый неглект",
    "Низкая мотивация пациента",
    "Нестабильное соматическое состояние",
    "Отсутствие заинтересованности родственников",
    "Онкология в анамнезе",
    "Возраст старше 80 лет",
    "Гиперопека семьи",
    "Декомпенсация хронических заболеваний"
]


rehab_goals = [
    "Увеличение толерантности к физической нагрузке",
    "Улучшение элементарных навыков самообслуживания",
    "Увеличение устойчивости вертикальной позы (в положениях сидя и стоя)",
    "Улучшение крупной и мелкой моторики",
    "Улучшение постановки стопы",
    "Улучшение навыка переноса веса тела",
    "Увеличение длины и симметричности шага",
    "Увеличение объема движений в суставе",
    "Увеличение скорости ходьбы и проходимого расстояния",
    "Подбор технических средств реабилитации",
    "Улучшение навыков самообслуживания (одевания, личной гигиены, приема пищи, ведение счетов и т.д.)",  # noqa: E501
    "Улучшение качества сна",
    "Улучшение социализации",
    "Уменьшение болевого синдрома",
    "Улучшение речевых функций",
    "Улучшение чувствительности",
    "Улучшение когнитивных функций",
    "Стабилизация эмоционального фона",
    "Обучение родственников основам ухода"
]
